Public Attributes | List of all members
API_CoordinateSystem Struct Reference
Analytical Model
Describes a coordinate system. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
API_Vector3D  | xVector
x direction of the coordinate system
API_Vector3D  | yVector
y direction of the coordinate system
Detailed Description
Describes a coordinate system.
Since
Archicad 24
Member Data Documentation
◆ xVector
 API_CoordinateSystem::xVector
x direction of the coordinate system
◆ yVector
 API_CoordinateSystem::yVector
y direction of the coordinate system